BASE: dict[str, str] = {
    'other_answer': 'Извини, увы, это сообщение мне непонятно...',
    "not_found": "Команда не найдена",
}

COMMANDS: dict[str, str] = {
    'start': '<b>Привет!\nЯ виртуальный помощник</b>\n\nЧтобы получить список комманд введите /help\n\nДля смены языка введите /language',
    'man': 'Справка: [аргумент] {множество аргуметов}',
    'language': "Выберите язык!",
}

HELP: dict[str, str] = {
    "start": "/start - Вывести приветственное сообщение",
    "help": "/help - Вывести список комманд",
    'man': '/man {commands} - Вывести документацию отдельно для каждой команды. Пишите команды без слеша',
    "language": "/language - Выбрать язык комуникации",
}
